       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       AUTHOR. COBOL2JAVA SAMPLE.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MESSAGE PIC X(20) VALUE "Hello, World!".
       
       PROCEDURE DIVISION.
       MAIN-PROC.
           DISPLAY WS-MESSAGE.
           STOP RUN.
